<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>PayloadDisplayName</key>
        <string>diyOpenDNSDoH</string>
        <key>PayloadIdentifier</key>
        <string>com.diy.dns.diyOpenDNSDoH</string>
        <key>PayloadUUID</key>
        <string>9877ACF3-420D-4E25-B3B8-96C8EB82A907</string>
        <key>PayloadDescription</key>
        <string>OpenDNS DNS-HTTPS(CCE)</string>
        <key>PayloadRemovalDisallowed</key>
        <false/>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>PayloadType</key>
        <string>Configuration</string>
        <key>PayloadContent</key>
        <array>
            <dict>
                <key>PayloadDisplayName</key>
                <string>OpenDNS DNS-HTTPS</string>
                <key>PayloadType</key>
                <string>com.apple.dnsSettings.managed</string>
                <key>PayloadIdentifier</key>
                <string>com.apple.dnsSettings.managed.684b6631-98ef-4534-ab68-baa22a4a3b81</string>
                <key>PayloadUUID</key>
                <string>0fedcb81-3c3d-4604-b90e-12ee51bdaee1</string>
                <key>PayloadVersion</key>
                <integer>1</integer>
                <key>ProhibitDisablement</key>
                <false/>
                <key>DNSSettings</key>
                <dict>
                    <key>DNSProtocol</key>
                    <string>HTTPS</string>
                    <key>ServerAddresses</key>
                    <array>
                        <string>208.67.222.222</string>
                        <string>208.67.220.220</string>
                    </array>
                    <key>ServerURL</key>
                    <string>https://doh.opendns.com/dns-query</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
